# shared - development
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/shared/infrastructure/workspaces/development relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/development-shared/runs/run-Bi9yfcrKCW4vyDVM

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cluster.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "development-database-cluster-id"
      + tags           = {
          + "environment"   = "development-shared"
          + "resource"      = "shared"
          + "resource_type" = "database-cluster"
        }
      + tags_all       = {
          + "environment"   = "development-shared"
          + "resource"      = "shared"
          + "resource_type" = "database-cluster"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.cluster.cockroach_cluster.default will be created
  + resource "cockroach_cluster" "default" {
      + account_id        = (known after apply)
      + cloud_provider    = "AWS"
      + cockroach_version = (known after apply)
      + creator_id        = (known after apply)
      + id                = (known after apply)
      + name              = "development-shared"
      + operation_status  = (known after apply)
      + plan              = (known after apply)
      + regions           = [
          + {
              + name       = "ap-southeast-1"
              + node_count = (known after apply)
              + primary    = (known after apply)
              + sql_dns    = (known after apply)
              + ui_dns     = (known after apply)
            },
        ]
      + serverless        = {
          + routing_id  = (known after apply)
          + spend_limit = 0
        }
      + state             = (known after apply)
      + upgrade_status    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*